# Задание №2
# Написать программу, которая выводит min из 2 чисел

print(min(int(input('Enter 1st number: ')), int(input('Enter 2nd number: '))))