# Задание 1:
# Создать три переменные, поместить в них  любые числа. После 
# вывести в консоль их значения, а также id ячейки памяти, к 
# которой обращается каждая переменная.

num1 = 10
num2 = 87
num3 = 2
print(num1, id(num1), num2, id(num2), num3, id(num3))