# Задание 2:
# Запросить у пользователя сперва имя, а потом фамилию. После 
# вывести текст: Привет, ИМЯ ФАМИЛИЯ. где ИМЯ ФАМИЛИЯ должны 
# быть данные введенные пользователем.

first_name = input('First Name: ')
last_name = input('Last Name: ')
print('Hello, ' + first_name + ' ' + last_name)