# Задание 3:
# Создать переменную а и поместить в неё значение 50, 
# после пере присвоить значение этой переменной на 
# строку - Привет, мир! В конце вывести в консоль значение переменной а.

a = 50
b = 'Hello World!'
a = b
print(a)