# Задание 6:
# Если переменная a не равна нолю, то выведите 'Верно',
# иначе выведите 'Неверно'. Проверьте работу скрипта при 
# a, равном 1, 0, -3.

a = int(input('Enter number: '))
if a == 0: print('Неверно')
else: print('Верно')