# Задание 2:
# Если переменная a больше нуля, то выведите 'Верно',
# иначе выведите 'Неверно'. Проверьте работу скрипта при 
# a, равном 1, 0, -3.

a = int(input('Enter number: '))
if a > 0: print('Верно')
elif a < 0: print('Неверно')
else: print('Неверно')