# Задание 9:
# Пользователь вводит порядковый номер пальца 
# руки. Необходимо показать его название на экран.

a = int(input('Enter one number from 1 to 5: '))
if a == 1: print('Большой палец')
elif a == 2: print('Указательный палец')
elif a == 3: print('Средний палец')
elif a == 4: print('Безымянный палец')
elif a == 5: print('Мизинец')