# Задание 7:
# Если переменная a равна 'test', то выведите 'Верно',
# иначе выведите 'Неверно'. Проверьте работу скрипта при 
# a, равном 'test', 'тест', 3.

a = input('Enter: ')
if a == 'test': print('Верно')
else: print('Неверно')