# Задание 4:
# Если переменная a больше или равно нулю, то выведите 'Верно',
# иначе выведите 'Неверно'. Проверьте работу скрипта при 
# a, равном 1, 0, -3.

a = int(input('Enter number: '))
if a >= 0: print('Верно')
else: print('Неверно')