# Задание 8:
# Если переменная a равна '1' и по значению и по типу, 
# то выведите 'Верно',
# иначе выведите 'Неверно'. Проверьте работу скрипта при 
# a, равном '1', 1, 3.

a = input('Enter: ')
if a == 1: print('Верно')
else: print('Неверно')